CSI API ETABS v1

# cDStAustralian_AS4100_2020 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDStAustralian_AS4100_2020

    Public Interface cDStAustralian_AS4100_2020

    Dim instance As cDStAustralian_AS4100_2020

    public interface class cDStAustralian_AS4100_2020

    type cDStAustralian_AS4100_2020 =  interface end

The cDStAustralian_AS4100_2020 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|  Retrieves the value
of a steel design overwrite item
|
GetPreference|  Retrieves the
value of a steel design preference item
|
SetOverwrite|  Sets the value of a
steel design overwrite item
|
SetPreference|  Sets the value of
a steel design preference item
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com